In [1]:
# This cell just makes juypter notebook use the full width of the screen and changes 
# some of the text to red.  You can ignore this cell
from IPython.core.display import HTML
HTML('<style>em { color: red; }</style> <style>.container {width:100% !important; }</style>')

# Review problem 3 from the worksheet

In [ ]:
v = Series([-1, 1, 200, 191, 4])
v < 0
0  True
1  False
2  False
3  False
4  False
dtype bool

In [ ]:
v = Series([-1, 1, 200, 191, 4])
v * v == 1
0  True
1  True
2  False
3  False
4  False
dtype bool

In [2]:
191*191

36481

In [ ]:
v = Series([-1, 1, 200, 191, 4])
v[v > 100]
index  value
2      200
3      191
dtype int64

In [ ]:
v = Series([-1, 1, 200, 191, 4])
v[v % 2 == 0]
2 200
4   4
dtype int64

In [ ]:
v = Series([-1, 1, 200, 191, 4])
v[(v>0) & (v<100)]
1    1
4    4 
dtype int64

In [8]:
import pandas as pd
from pandas import Series, DataFrame

### Data Alignment

In [9]:
x = Series({"A":10, "B":100})
s1 = Series({"A":2, "B":3})
s2 = Series({"B":3, "A":2})

In [10]:
x

A     10
B    100
dtype: int64

In [11]:
s1

A    2
B    3
dtype: int64

In [12]:
s2

B    3
A    2
dtype: int64

In [13]:
x * s1

A     20
B    300
dtype: int64

In [14]:
x * s2

A     20
B    300
dtype: int64

In [15]:
x < s1

A    False
B    False
dtype: bool

In [17]:
#  x < s2   Can only compare identically-labeled Series objects

In [18]:
x < s2.sort_index()

A    False
B    False
dtype: bool

### Series methods for relational operators

In [20]:
x.lt(s2) # less than
x.gt(s2) # greater than
x.le(s2) # less than or equal
x.ge(s2) # greater than or equal
x.ne(s2) # not equal
x.eq(s2) # equal

A    False
B    False
dtype: bool

# Data Frames

In [22]:
col1 = Series(["Alice", "Bob", "Cindy", "Dan"])    #name 
col2 = Series([4, 5, 6, 7])                        #scores

In [24]:
col1

0    Alice
1      Bob
2    Cindy
3      Dan
dtype: object

In [25]:
col2

0    4
1    5
2    6
3    7
dtype: int64

### DataFrame from dictionary of Series

In [26]:
DataFrame({
    "name":  col1,
    "score": col2,
})

    name  score
0  Alice      4
1    Bob      5
2  Cindy      6
3    Dan      7

### DataFrame from dictionary of lists

In [29]:
DataFrame({
    "name":  ["Alice", "Bob", "Cindy", "Dan"],
    "score": [4, 5, 6, 7],
})

    name  score
0  Alice      4
1    Bob      5
2  Cindy      6
3    Dan      7

### DataFrame from list of lists

In [30]:
DataFrame([
    ["Alice", "Bob", "Cindy", "Dan"],
    [4, 5, 6, 7],
])

       0    1      2    3
0  Alice  Bob  Cindy  Dan
1      4    5      6    7

In [40]:
DataFrame([
    ["Alice", 4],
    ["Bob", 5],
    ["Cindy", 6],
    ["Dan", 7]
])

       0  1
0  Alice  4
1    Bob  5
2  Cindy  6
3    Dan  7

### DataFrame from dictionary of dictionaries

In [33]:
DataFrame({
    "name":  {"A":"Alice", "B":"Bob", "C":"Cindy", "D":"Dan"},
    "score": {"A":4, "B":5, "C":6, "D":7},
})

    name  score
A  Alice      4
B    Bob      5
C  Cindy      6
D    Dan      7

### DataFrame from list of dictionaries

In [34]:
DataFrame([
    {"A":"Alice", "B":"Bob", "C":"Cindy", "D":"Dan"},
    {"A":4, "B":5, "C":6, "D":7},
])

       A    B      C    D
0  Alice  Bob  Cindy  Dan
1      4    5      6    7

In [37]:
DataFrame([
    {"Name":"Alice", "Score":4}, 
    {"Name":"Bob", "Score":5}, 
    {"Name":"Cindy", "Score":6}, 
    {"Name":"Dan", "Score":7}, 
])

    Name  Score
0  Alice      4
1    Bob      5
2  Cindy      6
3    Dan      7

### DataFrame from csv file

### Labeling the rows and columns

In [43]:
DataFrame([
    ["Alice", 4],
    ["Bob", 5],
    ["Cindy", 6],
    ["Dan", 7]
],
    index = ["A", "B", "C", "D"],
    columns = ["Name", "Score"]
)

    Name  Score
A  Alice      4
B    Bob      5
C  Cindy      6
D    Dan      7

### Data Lookup

In [49]:
scores = Series({"Alice":4, "Bob":5, "Cindy":6, "Dan":7})
scores

Alice    4
Bob      5
Cindy    6
Dan      7
dtype: int64

In [47]:
scores.loc["Bob"]

5

In [50]:
scores.iloc[1]

5

In [51]:
scores.iloc[-1]

7

In [52]:
scores["Cindy"]

6

In [53]:
scores[2]

6

In [72]:
df = DataFrame([
    ["Alice", 4],
    ["Bob", 5],
    ["Cindy", 6],
    ["Dan", 7]
],
    index = ["A", "B", "C", "D"],
    columns = ["Name", "Score"]
)
df

    Name  Score
A  Alice      4
B    Bob      5
C  Cindy      6
D    Dan      7

In [56]:
df.loc["A"]  #ROW INDEX

Name     Alice
Score        4
Name: A, dtype: object

In [57]:
df.iloc[2]  #ROW INTEGER POSITION

Name     Cindy
Score        6
Name: C, dtype: object

In [58]:
df["Name"]  #COLUMN INDEX

A    Alice
B      Bob
C    Cindy
D      Dan
Name: Name, dtype: object

In [62]:
df["Score"].sum()

22

In [63]:
df

    Name  Score
A  Alice      4
B    Bob      5
C  Cindy      6
D    Dan      7

In [64]:
df.loc["B", "Score"]

5

In [73]:
df.loc["D", "Score"] += 10
df

    Name  Score
A  Alice      4
B    Bob      5
C  Cindy      6
D    Dan     17

In [66]:
df.iloc[-1, 0]

'Dan'

### Slicing

In [67]:
df

    Name  Score
A  Alice      4
B    Bob      5
C  Cindy      6
D    Dan     17

In [68]:
# df.iloc[ROW INDICES, COLUMN INDICES]
df.iloc[1:3, :]

    Name  Score
B    Bob      5
C  Cindy      6

In [69]:
df.loc["B":"C", :]

    Name  Score
B    Bob      5
C  Cindy      6

In [74]:
df.iloc[:, 1] += 100   #all rows, score column
df

    Name  Score
A  Alice    104
B    Bob    105
C  Cindy    106
D    Dan    117

In [77]:
df.loc[["B", "D"], :]

  Name  Score
B  Bob    105
D  Dan    117

### Boolean Indexing

In [79]:
# s1[BOOL SERIES]  <- get all values that line up with True in the series
# d[X]             <- get all COLUMNS with index X
# d[BOOL SERIES]   <- get all rows that line up with True

A    2
B    3
dtype: int64

In [80]:
df

    Name  Score
A  Alice    104
B    Bob    105
C  Cindy    106
D    Dan    117

In [83]:
df[Series({"A":True, "B":False, "C":True, "D":False})]

    Name  Score
A  Alice    104
C  Cindy    106

In [84]:
Series({"A":True, "B":False, "C":True, "D":False})

A     True
B    False
C     True
D    False
dtype: bool

In [86]:
### get all rows with score greater than or equal to 106
df["Score"]

A    104
B    105
C    106
D    117
Name: Score, dtype: int64

In [89]:
b = df["Score"] >= 106

In [90]:
df[b]

    Name  Score
C  Cindy    106
D    Dan    117

### Create DataFrame from csv

In [100]:
# pd.read_csv(PATH)
df = pd.read_csv("IMDB-Movie-Data.csv")
df

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,3,Sing,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02
...,...,...,...,...,...,...,...,...,...
993,993,Secret in Their Eyes,"Crime,Drama,Mystery",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,0
994,994,Hostel: Part II,Horror,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,17.54
995,995,Step Up 2: The Streets,"Drama,Music,Romance",Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,58.01
996,996,Search Party,"Adventure,Comedy",Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,0
997,997,Nine Lives,"Comedy,Family,Fantasy",Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,19.64

In [99]:
# weird index gotcha
df.to_csv("A.txt")
df = pd.read_csv("A.txt")

In [103]:
df = df.iloc[:, 1:]
df

,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02
...,...,...,...,...,...,...,...
993,"Crime,Drama,Mystery",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,0
994,Horror,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,17.54
995,"Drama,Music,Romance",Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,58.01
996,"Adventure,Comedy",Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,0
997,"Comedy,Family,Fantasy",Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,19.64

In [105]:
df.to_csv("A.txt", index = False)

In [106]:
df.head()

,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02

In [109]:
df.head(2)

,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M

In [110]:
df.tail()

,Genre,Director,Cast,Year,Runtime,Rating,Revenue
993,"Crime,Drama,Mystery",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,0
994,Horror,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,17.54
995,"Drama,Music,Romance",Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,58.01
996,"Adventure,Comedy",Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,0
997,"Comedy,Family,Fantasy",Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,19.64

In [111]:
df.tail(3)

,Genre,Director,Cast,Year,Runtime,Rating,Revenue
995,"Drama,Music,Romance",Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,58.01
996,"Adventure,Comedy",Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,0
997,"Comedy,Family,Fantasy",Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,19.64

In [113]:
df["Year"]

0      2014
1      2012
2      2016
3      2016
4      2016
       ...
993    2015
994    2007
995    2008
996    2014
997    2016
Name: Year, Length: 998, dtype: int64

In [114]:
df.head()

,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02

In [116]:
df["Rating"].mean()

6.7234468937875755

In [117]:
df["Runtime"].max()

191

# What is the highest rated movie that had an above average runtime?

In [142]:
df = pd.read_csv("IMDB-Movie-Data.csv")

In [143]:
# average runtime
avg_runtime = df["Runtime"].mean()
avg_runtime

113.17034068136273

In [144]:
# create boolean series for above average runtimes
b= df["Runtime"] > avg_runtime
b.head()

0     True
1     True
2     True
3    False
4     True
Name: Runtime, dtype: bool

In [145]:
#df.head()

In [146]:
long_movies = df[b]
long_movies.head(4)

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
4,4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02

In [147]:
long_movies = df[df["Runtime"] > df["Runtime"].mean()]
long_movies.head(5)

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
4,4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02
6,6,La La Land,"Comedy,Drama,Music",Damien Chazelle,"Ryan Gosling, Emma Stone, Rosemarie DeWitt, J....",2016,128,8.3,151.06M

In [148]:
highest_rating = long_movies["Rating"].max()
highest_rating

9.0

In [149]:
# create boolean series to select the movies with rating == highest rating
b = long_movies["Rating"] == highest_rating
b.head()

0    False
1    False
2    False
4    False
6    False
Name: Rating, dtype: bool

In [150]:
long_movies[b]

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
54,54,The Dark Knight,"Action,Crime,Drama",Christopher Nolan,"Christian Bale, Heath Ledger, Aaron Eckhart,Mi...",2008,152,9.0,533.32

In [153]:
stats = df.describe()
stats

            Index         Year     Runtime      Rating
count  998.000000   998.000000  998.000000  998.000000
mean   498.500000  2012.779559  113.170341    6.723447
std    288.242086     3.207549   18.828877    0.945682
min      0.000000  2006.000000   66.000000    1.900000
25%    249.250000  2010.000000  100.000000    6.200000
50%    498.500000  2014.000000  111.000000    6.800000
75%    747.750000  2016.000000  123.000000    7.400000
max    997.000000  2016.000000  191.000000    9.000000

In [155]:
stats.loc["mean", "Runtime"]

113.17034068136273